backend: tensorflow
class_name: Model
config:
  input_layers:
  - [left_features, 0, 0]
  - [central_features, 0, 0]
  - [right_features, 0, 0]
  - [left_metas, 0, 0]
  - [central_metas, 0, 0]
  - [right_metas, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 16, 233]
      dtype: float32
      name: left_features
      sparse: false
    inbound_nodes: []
    name: left_features
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 16, 22]
      dtype: float32
      name: left_metas
      sparse: false
    inbound_nodes: []
    name: left_metas
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 16, 233]
      dtype: float32
      name: right_features
      sparse: false
    inbound_nodes: []
    name: right_features
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 16, 22]
      dtype: float32
      name: right_metas
      sparse: false
    inbound_nodes: []
    name: right_metas
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_1, trainable: true}
    inbound_nodes:
    - - - left_features
        - 0
        - 0
        - &id001 {}
      - - left_metas
        - 0
        - 0
        - *id001
    name: concatenate_1
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 181]
      dtype: float32
      name: central_features
      sparse: false
    inbound_nodes: []
    name: central_features
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 22]
      dtype: float32
      name: central_metas
      sparse: false
    inbound_nodes: []
    name: central_metas
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_2, trainable: true}
    inbound_nodes:
    - - - right_features
        - 0
        - 0
        - &id002 {}
      - - right_metas
        - 0
        - 0
        - *id002
    name: concatenate_2
  - class_name: TimeDistributed
    config:
      layer:
        class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          batch_input_shape: !!python/tuple [null, 255]
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          name: embedding_left
          trainable: true
          units: 200
          use_bias: true
      name: time_distributed_1
      trainable: true
    inbound_nodes:
    - - - concatenate_1
        - 0
        - 0
        - {}
    name: time_distributed_1
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_3, trainable: true}
    inbound_nodes:
    - - - central_features
        - 0
        - 0
        - &id003 {}
      - - central_metas
        - 0
        - 0
        - *id003
    name: concatenate_3
  - class_name: TimeDistributed
    config:
      layer:
        class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          batch_input_shape: !!python/tuple [null, 255]
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          name: embedding_right
          trainable: true
          units: 200
          use_bias: true
      name: time_distributed_2
      trainable: true
    inbound_nodes:
    - - - concatenate_2
        - 0
        - 0
        - {}
    name: time_distributed_2
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: lstm_left_0
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: true
      return_state: false
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 200
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - time_distributed_1
        - 0
        - 0
        - {}
    name: lstm_left_0
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 200
      use_bias: true
    inbound_nodes:
    - - - concatenate_3
        - 0
        - 0
        - {}
    name: dense_1
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: lstm_right_0
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: true
      return_state: false
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 200
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - time_distributed_2
        - 0
        - 0
        - {}
    name: lstm_right_0
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: lstm_left_1
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: false
      return_state: false
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 200
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - lstm_left_0
        - 0
        - 0
        - {}
    name: lstm_left_1
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_2
      trainable: true
      units: 200
      use_bias: true
    inbound_nodes:
    - - - dense_1
        - 0
        - 0
        - {}
    name: dense_2
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: lstm_right_1
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: false
      return_state: false
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 200
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - lstm_right_0
        - 0
        - 0
        - {}
    name: lstm_right_1
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_4, trainable: true}
    inbound_nodes:
    - - - lstm_left_1
        - 0
        - 0
        - &id004 {}
      - - dense_2
        - 0
        - 0
        - *id004
      - - lstm_right_1
        - 0
        - 0
        - *id004
    name: concatenate_4
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_3
      trainable: true
      units: 200
      use_bias: true
    inbound_nodes:
    - - - concatenate_4
        - 0
        - 0
        - {}
    name: dense_3
  - class_name: Dense
    config:
      activation: softmax
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: pitch_prediction
      trainable: true
      units: 52
      use_bias: true
    inbound_nodes:
    - - - dense_3
        - 0
        - 0
        - {}
    name: pitch_prediction
  name: model_1
  output_layers:
  - [pitch_prediction, 0, 0]
keras_version: 2.1.6
